# =====================
# Taps
# =====================
tap "homebrew/cask-fonts"
tap "rcmdnk/file"

# =====================
# CLI Tools
# =====================
brew "aria2"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "jpeg"
brew "libtiff"
brew "mas"
brew "nkf"
brew "telnet"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh"

# New tools
brew "fnm"
brew "uv"
brew "starship"
brew "zoxide"

# Zsh plugins (Homebrew管理)
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"

# =====================
# Cask - Dev Tools
# =====================
cask "warp"
cask "visual-studio-code"
cask "cursor"
cask "antigravity-ide"
cask "claude"
cask "claude-code"
cask "google-chrome"
cask "comet"

# =====================
# Cask - Productivity
# =====================
cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "hidock"
cask "karabiner-elements"
cask "appcleaner"
cask "daisydisk"
cask "keka"
cask "onyx"
cask "obsidian"
cask "notion"
cask "notion-calendar"
cask "calibre"
cask "cheatsheet"
cask "cursorsense"
cask "keyboardcleantool"

# =====================
# Cask - Cloud & Sync
# =====================
cask "dropbox"
cask "google-drive"
cask "google-japanese-ime"

# =====================
# Cask - DAW & Audio
# =====================
cask "ableton-live-suite"
cask "cycling74-max"
cask "native-access"
cask "ilok-license-manager"
cask "license-control-center"
cask "waves-central"
cask "izotope-product-portal"
cask "blackhole-16ch"
cask "splice"
cask "ik-product-manager"

# =====================
# Cask - Video & Media
# =====================
cask "vlc"
cask "stolendata-mpv"
cask "makemkv"
cask "xld"
cask "geekbench"

# =====================
# Cask - Remote & Virtualization
# =====================
cask "parallels"
cask "teamviewer"
cask "chrome-remote-desktop-host"

# =====================
# Cask - Hardware
# =====================
cask "caldigit-docking-utility"
cask "caldigit-thunderbolt-charging"
cask "displaylink"
cask "logi-options+"
cask "ua-connect"
cask "app-tamer"

# =====================
# Cask - Entertainment
# =====================
cask "spotify"
cask "steam"
cask "discord"
cask "kindle"
cask "amazon-music"

# =====================
# Cask - Fonts
# =====================
cask "font-ricty-diminished"

# =====================
# Cask - Other
# =====================
cask "adobe-creative-cloud"
cask "diskcatalogmaker"
cask "hot"
cask "zoom"

# =====================
# Mac App Store
# =====================
mas "AnyCleaner", id: 6444128735
mas "Display Menu", id: 549083868
mas "EdgeView 2", id: 1206246482
mas "Invisor", id: 442947586
mas "LadioCast", id: 411213048
mas "LINE", id: 539883307
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pixelmator", id: 407963104
mas "PlugInfo", id: 1626412949
mas "Reeder", id: 1529448980
mas "ScanSnap Cloud", id: 1035516352
mas "Xcode", id: 497799835

# =====================
# VS Code Extensions
# =====================
vscode "anthropic.claude-code"
vscode "beauallison.brew-services"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"

# =====================
# npm
# =====================
npm "defuddle-cli"
